#+TITLE: Programação no Org-Mode
#+AUTHOR: Kauê Patrick de Oliveira

**** Tabela
É possível passar tabelas Org como argumento para um código de blocos

*Exemplo 1*
Este código recebe uma tabela Org como argumento e sua saída é o tamanho da tabela
#+NAME: example-table
| 1 |
| 2 |
| 3 |
| 4 |
| 5 |

#+NAME: table-length
#+BEGIN_SRC emacs-lisp :var table=example-table
  (length table)
#+END_SRC

#+RESULTS: table-length
: 5

O argumento de cabeçalho "colnames" aceita os valores "yes", "no" e "nil" e define como o código lida com os nomes de colunas.
O valor padrão é "nil" e define que o bloco receba a tabela, remova os nomes das colunas (caso existam), processe a tabela e, por fim, coloque de volta os nomes das colunas na tabela.
Com o valor "yes", o comportamento é semelhante, exceto que a primeira linha é eliminada, independente de ela conter os nomes das colunas ou não.
Se o valor é "no", o bloco não processa ou imprime a primeira linha de nenhuma forma.

*Exemplo 2*
Utilizando o valor "nil", o bloco não processa a primeira linha (nome da coluna), mas a imprime no final.
#+NAME: less-cols
| a |
| b |
| c |

#+BEGIN_SRC python :var tab=less-cols :colnames nil
  return [[val + '*' for val in row] for row in tab]
#+END_SRC

#+RESULTS:
| a  |
|----|
| b* |
| c* |

Um comportamento semelhante ocorre com o argumento "rownames", que define como os blocos lidam com as linhas. A única diferença é que não existe o valor "nil", pois não há a diferenciação de nomes de linhas utilizando linhas, como "|-----|" para as colunas.

*Exemplo 3*
Através do valor "yes", o Org processa a tabela inteira, exceto pela primeira célula de cada linha.
#+NAME: with-rownames
| one | 1 | 2 | 3 | 4 |  5 |
| two | 6 | 7 | 8 | 9 | 10 |

#+BEGIN_SRC python :var tab=with-rownames :rownames yes
  return [[val + 10 for val in row] for row in tab]
#+END_SRC

#+RESULTS:
| one | 11 | 12 | 13 | 14 | 15 |
| two | 16 | 17 | 18 | 19 | 20 |

Utilizando a sintaxe ":var table=other-file.org:example-table", é possível receber tabelas Org de outro arquivo como argumento.

**** Listas
É possível também utilizar listas Org como argumento de blocos de código. Porém, itens aninhados da lista (sub-tópicos) são ignorados

*Exemplo 4*
Recebe uma lista e imprime seus itens
#+NAME: example-list
- simple
  - not
  - nested
- list

#+BEGIN_SRC emacs-lisp :var x=example-list
  (print x)
#+END_SRC

#+RESULTS:
| simple | list |

**** Blocos de código sem argumentos
A saída de um bloco também pode ser utilizada como argumento para outro bloco.

*Exemplo 5*
Utiliza a saída do bloco ~table-length~ anteriormente definido (que calcula o tamanho de uma tabela) como argumento
#+BEGIN_SRC emacs-lisp :var length=table-length()
  (* 2 length)
#+END_SRC

#+RESULTS:
: 10

**** Blocos de código com argumentos
É possível utilizar como argumento a saída de blocos de código que também possuem seus próprios argumentos

*Exemplo 6*
O bloco ~double~, com argumento ~input=1~, é utilizado como argumento de ~squared~
#+NAME: double
#+BEGIN_SRC emacs-lisp :var input=8
  (* 2 input)
#+END_SRC

#+RESULTS: double
: 16

#+NAME: squared
#+BEGIN_SRC emacs-lisp :var input=double(input=3)
  (* input input)
#+END_SRC

#+RESULTS: squared
: 36

**** Exemplos literais/Conteúdos de blocos de códig
Um código ou exemplo de literal pode ser utilizado como argumento através da palavra "NAME", seguida por colchetes (opcional para blocos de exemplo)
*Exemplo 7*
#+NAME: literal-example
#+BEGIN_EXAMPLE
  A literal example
  on two lines
#+END_EXAMPLE

#+NAME: read-literal-example
#+BEGIN_SRC emacs-lisp :var x=literal-example[]
  (concatenate #'string x " for you.")
#+END_SRC

#+RESULTS: read-literal-example
: A literal example
: on two lines for you.

No caso de variáveis como tabelas, utilizando os colchetes e um índice também é possível referenciar apenas uma parte da variável. Os índices se iniciam em 0 e valores negativos fazem a leitura do fim para trás. Utilizando vírgula e outro(s) indíce(s), é possível referenciar outras dimensões da variável. Porém, os indíces não removem os nomes das linhas e das colunas (mesmo quando se utiliza os argumentos "colnames" e "rownames")
*Exemplo 7*
O seguinte exemplo faz a leitura do valor na primeira linha (indíce 0) e na última coluna (indíce -1) da tabela
#+NAME: example-table
| 1 | a |
| 2 | b |
| 3 | c |
| 4 | d |

#+BEGIN_SRC emacs-lisp :var data=example-table[0,-1]
  data
#+END_SRC

#+RESULTS:
: a

Utilizando um sinal de dois-pontos entre dois inteiros em um indíce, é possível referenciar uma sequência de valores da variável
*Exemplo 8*
Este código faz a leitura da segunda (indíce 1) à quarta (indíce 3) linha da tabela.
#+NAME: example-table
| 1 | a |
| 2 | b |
| 3 | c |
| 4 | d |
| 5 | 3 |

#+BEGIN_SRC emacs-lisp :var data=example-table[1:3]
  data
#+END_SRC

#+RESULTS:
| 2 | b |
| 3 | c |
| 4 | d |

Para escolher o conjunto inteiro de dados, basta deixar o indíce vazio ou utilizar "*" ou "0:-1"
*Exemplo 9*
Imprime a primeira coluna da tabela
#+NAME: example-table
| 1 | a |
| 2 | b |
| 3 | c |
| 4 | d |

#+BEGIN_SRC emacs-lisp :var data=example-table[,0]
  data
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 |

*Exemplo 10*
Leitura por indíce de dados em três dimensões
#+NAME: 3D
#+BEGIN_SRC emacs-lisp
  '(((1  2  3)  (4  5  6)  (7  8  9))
    ((10 11 12) (13 14 15) (16 17 18))
    ((19 20 21) (22 23 24) (25 26 27)))
#+END_SRC

#+RESULTS: 3D
| (1 2 3)    | (4 5 6)    | (7 8 9)    |
| (10 11 12) | (13 14 15) | (16 17 18) |
| (19 20 21) | (22 23 24) | (25 26 27) |

#+BEGIN_SRC emacs-lisp :var data=3D[1,,1]
  data
#+END_SRC

#+RESULTS:
| 11 | 14 | 17 |

*** Exemplo de extração (salva o código em um arquivo)
#+begin_src C :tangle hello.c
  #include <stdio.h>
  int main() {
    printf("Hello World!\n");
    return 0;
  }
#+end_src

#+RESULTS:
: Hello World!

** Noweb
Blocos de código podem incluir referências para outros blocos, utilizando a sintaxe de estilo noweb

*Exemplo*
O segundo bloco inclui o primeiro bloco
#+NAME: initialization
#+BEGIN_SRC emacs-lisp
  (setq sentence "Never a foot too far, even.")
#+END_SRC

#+BEGIN_SRC emacs-lisp :noweb yes
  <<initialization>>
  (reverse sentence)
#+END_SRC

#+RESULTS:
: .neve ,raf oot toof a reveN

